app/controllers/test_controller.rb

	def oauth
		@data.xml_version = "v6"
		@data.shipping_suppression = false
		@data.rewards = false
		@data.auth_level_basic = false
		@data.redirect_shipping_profiles = ""
		@data.accepted_cards = "master,amex,diners,discover,maestro,visa"
		get_request_token
		post_shopping_cart
		@data.shopping_cart.shoppingCartItem.each do |item|
			Rails.logger.debug item.to_yaml
			s = Sale.new
	    	s.desc = item.description
	    	s.value = item.value
	    	s.quantity = item.quantity
	    	s.userId = current_user.id
	    	s.save
---
INSERT INTO "sales" ("desc", "value", "quantity", "userId", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["desc", "ds"], ["value", 333.0], ["quantity", 1], ["userId", 1], ["created_at", "2015-08-02 15:13:21.112639"], ["updated_at", "2015-08-02 15:13:21.112639"]]